core/app/Http/Controllers/SiteController.php

select count(*) as aggregate from `pages` where `tempname` = 'templates.basic.' and `slug` = 'home'
select * from `pages` where `tempname` = 'templates.basic.' and `slug` = 'home' limit 1
select `id`, `name` from `bloods` where `status` = 1
select `id`, `name` from `cities` where `status` = 1
---
    public function index(){
        $count = Page::where('tempname',$this->activeTemplate)->where('slug','home')->count();
        if($count == 0){
            $page = new Page();
            $page->tempname = $this->activeTemplate;
            $page->name = 'HOME';
            $page->slug = 'home';
            $page->save();
        }
        $reference = @$_GET['reference'];
        if ($reference) {
            session()->put('reference', $reference);
        }
        $pageTitle = 'Home';
        $sections = Page::where('tempname',$this->activeTemplate)->where('slug','home')->first();
        $bloods = Blood::where('status', 1)->select('id', 'name')->get();
        $cities = City::where('status', 1)->select('id', 'name')->get();

select `id`, `name` from `bloods` where `status` = 1
select * from `locations` where `locations`.`city_id` in (1)
select `id`, `name` from `cities` where `status` = 1
select * from `bloods` where `bloods`.`id` in (1)
select * from `donors` where `status` = 1 limit 20 offset 0
select * from `locations` where `locations`.`id` in (1)
select count(*) as aggregate from `donors` where `status` = 1
---
    public function donor()
    {
        $pageTitle = "All Donor";
        $emptyMessage = "No data found";
        $bloods = Blood::where('status', 1)->select('id', 'name')->get();
        $cities = City::where('status', 1)->select('id', 'name')->with('location')->get();
        $donors = Donor::where('status',1)->with('blood', 'location')->paginate(getPaginate());

select * from `donors` where `status` = 1 and `id` = 1 limit 1
---
    public function donorDetails($slug, $id)
    {
        $pageTitle = "Donor Details";
        $donor = Donor::where('status',1)->where('id', decrypt($id))->firstOrFail();

select * from `languages` where `code` = 'en' limit 1
---
    public function changeLanguage($lang = null)
    {
        $language = Language::where('code', $lang)->first();

select * from `locations` where `locations`.`city_id` in (1)
select `id`, `name` from `cities` where `status` = 1
select `id`, `name` from `bloods` where `status` = 1
---
    public function applyDonor()
    {
        $pageTitle = "Apply as a Donor";
        $cities = City::where('status', 1)->select('id', 'name')->with('location')->get();
        $bloods = Blood::where('status', 1)->select('id', 'name')->get();

insert into `donors` (`name`, `email`, `phone`, `city_id`, `blood_id`, `location_id`, `gender`, `religion`, `profession`, `address`, `details`, `total_donate`, `birth_date`, `last_donate`, `socialMedia`, `image`, `updated_at`, `created_at`) values ('dem', 'demo@gmail.com', '2352345', '1', '1', '1', '1', 'islam', 'Software Developer', 'Mirpure', 'Dfadsf', '30', '2023-11-17 00:00:00', '2023-11-14 00:00:00', '{\"facebook\":\"https:\/\/www.facebook.com\/\",\"twitter\":\"https:\/\/www.twitter.com\/\",\"linkedinIn\":\"https:\/\/www.facebook.com\/\",\"instagram\":\"https:\/\/www.facebook.com\/\"}', '655b23d590e531700471765.png', '2023-11-20 09:16:05', '2023-11-20 09:16:05')
---
            }
            $donor->image = $filename;
        }
        $donor->save();